# BoundaryLinearRestraintZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryLinearRestraintZ Property
ParameterTypeId Class See Also
---
"Z Spring Modulus"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryLinearRestraintZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryLinearRestraintZ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryLinearRestraintZ {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace